{
  "devotionals": {
    "2024-09-01": {
      "scripture": {
        "reference": "Jeremiah 29:11 (NKJV)",
        "text": "For I know the thoughts that I think toward you, says the LORD, thoughts of peace and not of evil, to give you a future and a hope."
      },
      "day": "1",
      "image": "day1.jpg",
      "title": "GOD IS INTENTIONAL ABOUT YOU",
      "devotionalText1": "If I had a dollar for every time Bro Bams said this to me, I would probably be Africa’s richest young woman! I never understood what this meant until God began to teach me. The truth we often struggle with is that God is not too busy for you. God is individualistic in His approach, meeting each one in the way that is unique to them. ",
      "devotionalText2": "There is no blanket approach with God, He can come as a still small voice today and a consuming fire tomorrow, He is all you can ever need. The Bible is full of the lives of various men and women, many of whose relationship with Him differed from that of another. God knows us even better than we know ourselves, and He relates with us with the love language that is unique to each one.",
      "devotionalText3": "Isn’t it amazing to think that the Almighty God, Creator of the heaven and earth, has you in mind on repeat? The verse for today says that ‘He knows the thoughts…’ meaning that He thinks of you multiple times, not just once. If we truly believe the words of Jeremiah 29:11, then we would know that whatever instruction God gives to us is to lead us to the future that He has for us. It would help us understand indeed that His commandments are not grievous.",
      "devotionalText4": "Don’t let any voice whisper to you anything that is contrary to the Word of God. 2 Corinthians 1:4 says that God comforts us so we can comfort others. He wants us to heal first so we can help others heal. Never forget His intentionality!",
      "devotionalText5": "",
      "reflection": "How intentional are you in your relationship with God?",
      "prayer": "Lord, help me to understand Your love...Father, I pray that You teach me to know how intentional You are about me, and help me to be intentional in loving and serving You.  ",
      "affirmation": "God is intentional about me!",
      "author": "Akioya Iyobosa"
    },
    "2024-09-02": {
      "scripture": {
        "reference": "Ecclesiastes 12:1 KJV",
        "text": "“Remember now thy Creator in the days of thy youth, while the evil days come not, nor the years draw nigh, when thou shalt say, I have no pleasure in them”"
      },
      "day": "2",
      "image": "day2.jpg",
      "title": "A CALL TO INTENTIONALITY IN OUR WALK WITH GOD",
      "devotionalText1": "The Bible in Eccl. 12:1 is very instructive on what is expected of us, God’s creations, to do while we’re young - to remember Him. A youth is someone aged between 15-24. This is a susceptible phase of one’s life where decisions made and habits formed translate into the definition of a general outcome of a person’s life, e.g., what course to study in university, who to marry, where to live, etc. Hence, the writer of the book of Ecclesiastes encourages us to include thoughtful and intentional remembrance of our Creator - God, amid our seemingly busy youthful  days.",
      "devotionalText2": "It is no news that how you make your bed is how you’ll lie on it. Therefore, your level of devotion to God now - knowing Him and making Him known - would be all you have to hold on to in your latter days (Eccl 12:2-8).",
      "devotionalText3": "My charge to you today is to build structures and set systems in place that daily bring you to commune with God. Practice thanksgiving to God for everything (1Thess. 5:18), study the word (Josh. 1:8, 2Tim. 2:15), spend time in prayer (1Thess 5:17), fellowship with believers (2Cor. 6:14), make God known to others (Col. 1:28). Overall, start today to intentionally live like and for Christ (Tit. 2:1-15).",
      "devotionalText4": "Finally, please note that a subsidiary of one of the purposes for which our Creator made us - making Him known, is to make Him known to our children (biological or not), to see that even from a young age, they are solidly rooted in Christ. We can achieve this by teaching them (Deut. 6:7) and by being an example worthy of emulation (1Tim. 4:12), and this can only happen if we start getting ourselves equipped now. Start now and daily work at living for Christ.",
      "devotionalText5": "",
      "reflection": "What can I do differently to build the habit of daily remembering God?",
      "prayer": "Lord, help me to understand Your love...",
      "affirmation": "Daily, I fear God. I worship Him with awe-filled reverence, knowing He is almighty God, and I keep His commandments. I am equipped daily to live for Christ and like Christ, and I make Him known in my words and actions, in Jesus’ name. Amen.",
      "author": "Sennuga, Adeiyin Adeyege"
    },
    "2024-09-03": {
      "scripture": {
        "reference": "PROVERBS 20:25",
        "text": "“It is a snare for a man to devote rashly something as holy and afterward reconsider his vows.”"
      },
      "day": "3",
      "image": "day3.jpg",
      "title": "COMMITMENT",
      "devotionalText1": "A commitment is a promise or a firm decision to willingly do something that will take your time, energy, or money in order to accomplish a goal or task. It describes the ability to stay till there is a positive outcome. Deuteronomy 23:21 says that when you make a vow to the LORD, your God, you shall not delay to pay for the Lord your God will require it of you and it would be counted as sin to you. This depicts commitment as a vow that must be fulfilled unfailingly once made else, it is accounted as sin to you.",
      "devotionalText2": "Naturally, as men, commitment seems very uncomfortable as it requires showing up consistently regardless of the situations or circumstances one may face to ensure the goal is accomplished in due time. Commitment breeds discipline, dedication, perseverance, and sacrifice. It grooms love and hope but most importantly it requires courage. The courage to follow through till the end, showing up even at times of inconvenience just so that the goal is accomplished. ",
      "devotionalText3": "This uncompromising choice is what we have consistently enjoyed as children of the living God; he has made a choice to remain committed to us and he will never reconsider his decision. The Lord has never and will never stop being committed to you, you should reciprocate that commitment in your walk with Him also.",
      "devotionalText4": "",
      "devotionalText5": "",
      "reflection": "Are you tired of living a life of inconsistency? Are you tired of being hot today and cold tomorrow? If yes, make a choice today to give it all it takes to stand for Life and refuse to let anything derail you from your decision. It starts with one choice!",
      "prayer": "Lord, I see the place of commitment now and I acknowledge your intentionality for me. I ask for the grace to always choose you as you have always chosen me every step of the way. Amen.",
      "affirmation": "I choose to live a life that is fully committed to Christ!",
      "author": "Komolafe Olubukola"
    },
    "2024-09-04": {
      "scripture": {
        "reference": "Colossians 4:2",
        "text": "“Devote yourselves to prayer with an alert mind and a thankful heart.”"
      },
      "day": "4",
      "image": "day4.jpg",
      "title": "DEVOTE  YOURSELF TO PRAYER",
      "devotionalText1": "Prayerlessness is almost always a humility issue—the natural consequence of a heart that tends to believe it is good without God. -Jackie Hill Perry. If you still have a mortal body, it means that, to a great extent, Maslow's hierarchy of needs applies to you. It means that you are human and therefore constantly needy. Your needs also equate to different things you use your life for: you love and receive love, you eat, you work, and you relax. ",
      "devotionalText2": "You celebrate the festive seasons; you plan your life, and generally, you go to the toilet. If you are also a Christian, like me, you pray. However, a question is necessary: What do you think prayer is? You guessed it—talking to God. But do you really believe that you have to talk to God? Think about it; there are several things you can do apart from praying. In fact, when you pray, you almost always remember everything you need to do or should have done. You are tempted to leave prayers and go ahead to do ‘better’ things. But it is not true. ",
      "devotionalText3": "Nothing is better and more worth doing than praying. Paul did not think it was feel-good advice when he asked us to devote ourselves to prayer; he knew it was our lifeline. I am adding another need to Maslow’s: you ought to always pray. This is how you must pray: when you go to church, when you bathe. When you walk on the road, when you work, when you do anything and everything. You might or should set aside some time in the day to pray, but can I add something? Pray every time; just talk to God. ",
      "devotionalText4": "This is how we devote ourselves to prayer. If you are constantly as needy as I think you are, you should constantly pray. Lastly, if you are a Pentecostal like me, you might be tempted to have all your prayers in tongues. But I have found it useful for several months now to incorporate praying in my understanding. ",
      "devotionalText5": "Praying in your understanding helps you keep your mind focused. It is true that prayers edify your spirit, but it must also edify your mind. After all, your mind interferes with your spirit. When you pray in your understanding, you are not praying less; you are not doing yourself a disservice.",
      "reflection": "Have you lived a devoted life praying to God? Also, do you actually pray, or does your mind wander off to a thousand places all through the course of your prayers?",
      "prayer": "Lord, you gave me access to you, and I don't take this access for granted. I ask that you help me to consistently seek you with an alert mind and a grateful heart. In Jesus’ name, Amen.",
      "affirmation": "I am loved by God.",
      "author": "Dami BHF"
    },
    "2024-09-05": {
      "scripture": {
        "reference": "1 John 4:16 KJV",
        "text": "“And we have known and believed the love that God hath to us. God is love; and he that dwelleth in love dwelleth in God, and God in him.”"
      },
      "day": "5",
      "image": "day5.jpg",
      "title": "HESED TO AGAPE",
      "devotionalText1": "The love of God towards us began even before creation, extending through our existence, death, and into eternity. His love is deeply personal and unconditional, centered on His nature rather than our actions. If God's love were based on our behavior, He would not love us when we err. Yet, He loves us just as we are. ",
      "devotionalText2": "God's love is about who He is. No matter where we are or what we do, He loved us first. “Behold what manner of love the Father has bestowed upon us” (1 John 3:1). The Bible tells us that we have been given the Spirit of sonship, allowing us to call out “Abba Father”(Romans 8:15). ",
      "devotionalText3": "This dual invocation—Father as His name and Father as His role in our lives—reflects an intimacy with God that is beyond our wildest dreams. ",
      "devotionalText4": "As Christians, God's love for us is the ultimate model for how we should love others. His understanding and unwavering love inspire us to extend that same love and grace to those around us. Let this divine love guide and empower us to live out His command to love one another.",
      "devotionalText5": "",
      "reflection": "Do you truly understand God’s love for you? Can you recall those moments when it felt like all odds were against you, and it was only the love of God that sustained you?",
      "prayer": " Father, help me remember Your love for me every time it feels like the world is against me.",
      "affirmation": " I am eternally and unconditionally loved by God. He cherishes me, and I am His beloved.",
      "author": "Akande Oluwaseun "
    },
    "2024-09-06": {
      "scripture": {
        "reference": "Hebrews 13:5b NIV",
        "text": "“…because God has said, “Never will I leave you; never will I forsake you.”"
      },
      "day": "6",
      "image": "day6.jpg",
      "title": "THE GOD WHO STAYS",
      "devotionalText1": "Have you ever wondered why some fathers abandon their children? Or haven’t you seen friends deny themselves and become sworn enemies? You must have seen strong relationships become broken and unmendable for life. ",
      "devotionalText2": "Even marriage, which is the only legal contract and scriptural covenant that binds two individuals ( Male and Female) together for life, has been broken severally by the same people that made the vows. These are clear pointers to the unreliability and frailty of the being called man. I am not telling you to live life alone, neither am I telling you to trust no one, I am only emphasizing the biblical truth that, the Almighty God is the only dependable and reliable One. ",
      "devotionalText3": "Psalms 27:10 says “Even if my father and mother abandon me, the Lord will hold me close.” Life comes with it’s ups and ups and it gets to a stage where every man is for himself. At that point, you can’t blame anyone because they are also trying to navigate life. ",
      "devotionalText4": "So in those seasons, you may turn to your left and to your right and find no one, but maybe you didn’t check well because right where you are searching, is a God who stays! He has never and will never move a step  away. So instead of getting angry and being bitter at those who weren’t there for you, why not channel that energy into locating God and remain focused on Him. He is a God who says a thing and will never turn back on his word. He has said He will never leave you! Even though friends may forsake you, family may reject you but there is a God who will never move an inch away from you. He is never closer to you in good times than He is in bad times, He is always close and will always be close. ",
      "devotionalText5": "Do you believe this?  Find comfort in the truth of God’s word today for as long as you are his Child, He never leaves. He is THE GOD WHO STAYS regardless of what happens. He stays, come what may! You can bank on this truth any day, any time.",
      "reflection": "Have you ever thought God left you at any point in time? Do you now believe His word that he will never leave you?",
      "prayer": "Lord, help me to understand Your love...",
      "affirmation": "The God I serve, is the God who stays!!!",
      "author": "Aresiola Elizabeth "
    },
    "2024-09-07": {
      "scripture": {
        "reference": "Habakkuk 3:2 NLT",
        "text": "“I have heard all about you, Lord. I am filled with awe by your amazing works. In this time of our deep need, help us again as you did in years gone by. And in your anger, remember your mercy.”"
      },
      "day": "7",
      "image": "day7.jpg",
      "title": "IS IT THE SAME GOD?",
      "devotionalText1": "”But If the lord is with us why are all this happening to us?”. Judges 6: 12-17. Due to the challenges of life, we begin  to wonder  if it is the same God our fathers serve we are still serving. We begin to wonder if it is the same God that is so jealous of his people we are still serving till today. We wonder if it is the same God that cannot behold iniquities nor allow his children to see corruption that we still serve. ",
      "devotionalText2": "Ahhh! Is it the same God that doesn't allow the righteous to be forsaken nor his children beg for bread we are still serving? Was He not the one that delivered the three Hebrew boys from the fiery fire? Wait! Was he not the fourth man in the fire again? These and many more questions we asked when passing through tough times that seems to question the One we believe. Beloved, the answer is Yes, He is the One and more. If you read Judges 6:13- 14 you will discover that Gideon made those statements because of the sufferings they were facing then. ",
      "devotionalText3": "Now like Gideon you might be asking the same question, why has God not come through for me yet, you have been waiting for God to show up for your case but it seems to no avail. Relax and go in this thy might read Habakkuk 3:1-2, be like Habakkuk, stand in awe of God’s deeds and pray that he show forth himself once again. Tell him to repeat them once again. ",
      "devotionalText4": "Conclusively, Habakkuk 3:17 says,  “Though the fig tree doesn't bud and there are no grapes on the vines, though the olive crops fails and the fields produce no food, though there are no sheep in the sheepfold and no cattle in the stalls yet I will be joyful in God my Savior.” Let this be your resolve, so yes it's the same God whether things get greener or not He remain the same.",
      "devotionalText5": "Shallom!",
      "reflection": "When things are not going in the direction they ought to go what do you do? Will you like Habakkuk pray to God in times of challenges? Will you like Habakkuk say whether things works out or not I will be joyful in God my Savior?",
      "prayer": "Lord, grant me the grace to trust you  at all times, I will not give up in the midst of challenges, grace to finish well and to finish strong is release unto me in Jesus name, I will rejoice in the Lord my always.",
      "affirmation": "",
      "author": "Ovedje Aghogho "
    },
    "2024-09-08": {
      "scripture": {
        "reference": "Romans 12:1-2",
        "text": "“Therefore, I urge you, brothers and sisters, in view of God’s mercy, to offer your bodies as a living sacrifice, holy and pleasing to God—this is your true and proper worship.  Do not conform to the pattern of this world but be transformed by the renewing of your mind. Then you will be able to test and approve what God’s will is—his good, pleasing and perfect will.”"
      },
      "day": "8",
      "image": "day8.jpg",
      "title": "WORSHIP",
      "devotionalText1": "A friend invited me to a program at Petra Christian Center in Abuja, tagged 'The Prosperity'. However, Pastor Ayo primarily focused on the concept of worship. He made a profound statement: “Worship is an exchange.” ",
      "devotionalText2": "In the Old Testament, when the Bible mentions that the Israelites went to worship God, it meant they went to offer sacrifices to their Lord. While worship songs and singing in the Holy Ghost are important, it is crucial to understand the true essence of worship. Worship is sacrifice. ",
      "devotionalText3": "In Genesis 22:5, Abraham told his young men to wait with the donkeys while he and his son went to worship. He wasn't lying; he understood that worship meant sacrifice. Giving yourself to God is a form of worship. ",
      "devotionalText4": "Living like Christ, subduing your flesh, surrendering to His will, intentionally setting aside time for God, and obeying His Word are all forms of worship. Your life becomes a form of worship when you truly reflect Christ. ",
      "devotionalText5": "Make sure God is first in your decisions, your life, and your family. That is the true form of worship. So, ask yourself, am I choosing something else over God? Am I truly surrendered to His will? ",
      "reflection": "",
      "prayer": " God, help me to always remember that I live for you. Engrace me to live like Christ and obey your words.",
      "affirmation": "I live for Christ. I am surrendered to His will. The flesh has no hold over me. My life is a form of worship.",
      "author": "Akodu Faith"
    },
    "2024-09-09": {
      "scripture": {
        "reference": "Jer. 31:25 NLT",
        "text": "“For I have given rest to the weary and joy to the sorrowing”"
      },
      "day": "9",
      "image": "day9.jpg",
      "title": "Grieving and Worshipping",
      "devotionalText1": "The Bible tells us stories of so many heroes of faith. One of the things most of the characters in the Bible had in common is that they all went through suffering at some point in their story. And we know and relate with them because of their sufferings, hoping to use their story as a guide to make it through. ",
      "devotionalText2": "One of my favorite characters in the Good Book is Jeremiah, popularly known as the Weeping Prophet. He watched Israel get torn to pieces and lost a lot of friends, family, and community members during this time. I cannot relate to that, but I went through a tough season of grief in 2023, during which I remembered a verse of scripture my dad had sung almost every morning since I was a child, ",
      "devotionalText3": "“The steadfast love of the Lord never ceaseth, His mercies never come to an end, they are new every morning, always, new every morning. Great is thy faithfulness oh Lord, Great is thy faithfulness”. ",
      "devotionalText4": "I knew where the scripture was in Lamentations. I read it and read it, and I still read it today because if Jeremiah, who did not know about the resurrection, could “joy another joy”, why should I allow myself to drown in grief? Now, I am not saying that I did not grieve, but I did not let it consume me or take away the fact that I believed in the goodness of God. ",
      "devotionalText5": "Today, I want to invite every sorrowful heart to come to the one who gives joy, sometimes, the process of letting go of the pain is hard, but God wants you to be joyful.",
      "reflection": "Where are you experiencing pain in your heart today?",
      "prayer": " Lord, I believe with all my heart that you understand the pain in my heart, today, I welcome you to help me in the process of healing so that I can worship you in spirit and in truth. Thank You because I know You are always with me and for me. In Jesus name. Amen.",
      "affirmation": "The joy of the Lord is my strength, in every situation and circumstance, God is walking with me and He is for me.",
      "author": "Faith Dimowo."
    },
    "2024-09-10": {
      "scripture": {
        "reference": "Matthew 11:28-30",
        "text": "“Come unto me, all ye that labour and are heavy laden, and I will give you rest. Take my yoke upon you, and learn of me; for I am meek and lowly in heart: and ye shall find rest unto your souls. For my yoke is easy, and my burden is light.”"
      },
      "day": "10",
      "image": "day10.jpg",
      "title": "Sometimes, Give up",
      "devotionalText1": "Does anybody ever say this? No? I thought so too. But you see, giving up is not the total demon that we have painted it to be, at least not when you’re giving up to Give God.",
      "devotionalText2": "Do you understand how hard it is to bear the weight of your family, your finances, that almost failing talking stage(lol), and that overbearing boss, all by yourself? Do you want to faint?  ",
      "devotionalText3": "Obviously not. Now what if I tell you there’s an easier way? That you don’t have to bear this all by yourself, that there is someone interested in lifting all of these burdens from you, so you can have life and bear the one that he gives, the yoke that is easy. I almost didn’t believe it at first, it felt too good to be true, but come to think about it, is that not exactly how the gospel feels? Too good to be true! This morning I want to urge you to give all of that up to Jesus, you were not created for that. ",
      "devotionalText4": "Are you not a soft babe/guy? It might not look like the responsible thing to do, but trust in him, if he dresses the lilies you can be rest assured that he will take care of you, so next time you feel that urge to take the weight of the world on your chest, remind yourself that someone already did that and he is offering you rest. ",
      "devotionalText5": "Action point: Today, before you begin to worry about that issue, take it to God first in prayer, and put your mind at peace. ",
      "reflection": "",
      "prayer": "Lord help us to remember that we can find rest in you, and to swap our heavy burdens for your light yoke, in Jesus name, Amen. ",
      "affirmation": "",
      "author": "Waziri Favour"
    },
    "2024-09-11": {
      "scripture": {
        "reference": "ECCLESIASTES 3:11 (NLT)",
        "text": "“Yet God has made everything beautiful for its own time. He has planted eternity in the             human heart, but even so, people cannot see the whole scope of God’s work from beginning to end.”"
      },
      "day": "11",
      "image": "day11.jpg",
      "title": "SOMETIMES ALL IT TAKES IS TIME",
      "devotionalText1": "I once ‘comedically’ told someone that one of the most neglected ingredients of any potentially delicious meal is time. Think about it though, after you have put all the necessary ingredients into your food, the last thing you will give that meal is time to cook properly and that is what makes it ready to eat. It’s the same with a lot of us that feel dismayed with certain things not working in our lives. ",
      "devotionalText2": "The truth is that we are going through a lot of things and we have already invested a lot into certain enterprises for it to succeed but in truth what is left is for time to take its course for it to come to fruition. A word may have been spoken into our lives but we must we must wait trusting in the truth of Gods word in Habakkuk 2:3 that though the vision, the dream, the promise, the confirmation, the manifestation etc. tarries, we should wait for it.  ",
      "devotionalText3": "Sometimes the manifestation of certain realities in our lives does not answer to prayer and fasting but to simply waiting and trusting that every word sent from God must come to manifestation no matter how long. ",
      "devotionalText4": "Remember that it took God time (six days) to create the whole world and all that He created was good so everything considered good takes time too. I strongly recommend to listen to Qavah Anthem by Abbey Ojomu. ",
      "devotionalText5": "",
      "reflection": "Is waiting a strengthening process or burdening process for Me?",
      "prayer": "Abba, I do not want to experience the regret of giving up. I ask for grace to keep waiting and to be strengthened as I wait.",
      "affirmation": "He makes all things beautiful in His time. I am not excluded from that truth. I remain in the waiting room until my beauty is evident to all.",
      "author": "Ilediagu Chijioke."
    },
    "2024-09-12": {
      "scripture": {
        "reference": "Psalm 37:7 (TPT)",
        "text": "“Quiet your heart in his presence and wait patiently for Yahweh. And don’t think for a moment that the wicked, in their prosperity are better off than you.”"
      },
      "day": "12",
      "image": "day12.jpg",
      "title": "THE WAIT PHASE",
      "devotionalText1": "Everyone experiences a wait period at one point or the other. Waiting for something can be a difficult thing to do and very tiring but it requires patience and a lot of faith. Most people confuse preparation as stagnation and that’s when frustration sets in.",
      "devotionalText2": "We think progress is moving up while sometimes progress is just standing on the same point. Sometimes, things take too long to happen. You wonder why you haven’t gotten that job yet or why you aren’t married or why none of your applications has been responded to or why things aren’t just working at all. All these things that you think aren’t working out is to tell you that God is preparing you. ",
      "devotionalText3": "Let’s look at Jesus Christ as an example, He couldn’t perform any miracle for 30 years and yet, he’s God’s own Son. Jesus wasn’t stagnated but was in the preparation phase. All Jesus needed was 3 and a half years and the whole world knew and experienced him. The worst thing to happen is to arrive at destiny unprepared. There’s a difference between a pregnant woman and a nursing mother which is Time. One has manifestation within while the other one’s manifestation is outside. ",
      "devotionalText4": "So when you fall under pressure, remind yourself that you are carrying something within and you are pregnant with something and you won’t allow the nursing mothers to intimate you. Do not abort your pregnancy when you see nursing mothers. ",
      "devotionalText5": "",
      "reflection": "During your wait phase, do not allow negative thoughts to cloud your mind. Remember God is with you and God is for you. In every wait phase, there’s a lesson, ask God to show you what he’s teaching you. As you go through your day today, you can listen to Firm Foundation (He won’t) by Maverick city and Oceans (where feet may fail) by Hillsong United to boost your faith.",
      "prayer": "“Dear Lord, make my faith and trust in you become stronger that in all things, I know that you are for me and you are with me.”",
      "affirmation": "God is with me and God is for me.",
      "author": "Teniayo Awosikunde "
    },
    "2024-09-13": {
      "scripture": {
        "reference": "Isaiah 40:31 (MSG)",
        "text": "“But those who wait upon God get fresh strength. They spread their wings and soar like eagles, They run and don't get tired, they walk and don't lag behind”"
      },
      "day": "13",
      "image": "day13.jpg",
      "title": "WAITING BUT WORKING",
      "devotionalText1": "Imagine a pregnant woman eagerly anticipating the arrival of her child. Though she waits, her days are filled with preparation. From nurturing her body to creating a nurturing environment for her baby, her waiting is not idle but filled with purposeful actions. ",
      "devotionalText2": "Similarly, as we wait upon the Lord for His promises to manifest in our lives, we are called to active waiting. We don't sit passively but engage in the work He has set before us. Like the pregnant woman, our waiting is not a time of idleness but of preparation and obedience. We trust in His timing and His ways, knowing that as we wait but work, He will renew our strength. ",
      "devotionalText3": "This strength isn't just physical; it's a deep-seated resilience that enables us to persevere through uncertainties. Let us embrace the tension of waiting but working, knowing that God is faithful to fulfill His promises in His perfect timing. ",
      "devotionalText4": "As we remain diligent in our tasks and steadfast in our faith, He empowers us to press on knowing that His plans for us are good and finally we will soar on wings like eagles. Incorporate daily practices such as prayer, service, and other activities that will improve your spiritual growth thereby aligning you with God's purposes.",
      "devotionalText5": "",
      "reflection": "How can you actively wait upon the Lord while pursuing His purposes?",
      "prayer": "Dear Lord, help me remain diligent as I wait upon You. Strengthen me in uncertainty and help me trust Your timing. Amen.",
      "affirmation": "I trust in God's timing, actively waiting and working towards His promises.",
      "author": "Akinlose Favour"
    },
    "2024-09-14": {
      "scripture": {
        "reference": "Jeremiah 29:11",
        "text": "“For I know the thoughts that I have towards you, saith the Lord, thoughts of peace, and not of evil, to give you an expected end.”"
      },
      "day": "14",
      "image": "day14.jpg",
      "title": "TRIUMPH OVER WALKING IN DENIAL",
      "devotionalText1": "Before I formed thee in the belly I knew thee, and before thou camest forth out of the womb I sanctified thee, and I ordained thee a prophet unto nations (Jeremiah 1:5.) There is a saying that goes thus, 'how you address and see yourself is how you'll be addressed and seen.'",
      "devotionalText2": " As a believer, you have to see yourself in the light of God and others will see you as His light. (proverbs 22:29) Many believers are mostly in need because they do not know the exact thing they need. God’s thoughts towards us are one in a million. His word says “He shall supply all your needs according to his riches in glory by Christ Jesus” (Philippians 4:19). Most times, a lot of things seem difficult and impossible due to the lack of knowledge of who we are in Christ Jesus. Remember, 1 Peter 5:7 says “Cast all your fears upon him, for he cares for you. ",
      "devotionalText3": "More often than not, I ask myself these questions: Who am I? How do I see myself? How does God see me? Who does God say I am? Am I in the will of God? We cannot have all of these questions answered fully and claim to still be in denial of our person and abilities in Christ. God is not an intruder, you can't claim to have, and you can't claim to know when you do not ask Him. He said “Come unto me all who labor and are heavily laden and I will give the rest” (Matthew 11:28) You either realize early and move on or realize late and suffer stagnation for a long time, there’s a breaking point you need to get to unveil that which He has for you. ",
      "devotionalText4": "Staying in denial is closing doors of certainty and possibilities. You are a destiny tied to another destiny that is tied to another destiny. Of what use then is it to deny yourself access to kingdom instructions? Of what use is it to be stagnated, denying yourself of manna (that which is good and beautiful)? Denial only causes delay and delay leads to frustration and then frustration leads to death, (Ephesians 5:14)” For anything that becomes visible is light. ",
      "devotionalText5": "Therefore, it says, Awake, O sleeper, and arise from the dead, and Christ will shine on you”. With (Habakkuk 3: 17-19) I leave you dearest reader, “There's always a blueprint, do not miss it by thinking that everything will work out, thereby neglecting that for it to work, you have to work”. ",
      "reflection": "The business of triumph is personal. Will you decide to choose triumph over denial?",
      "prayer": " I pray that the eye of my understanding be enlightened in Jesus' mighty name, Amen. ",
      "affirmation": "",
      "author": "Adewuyi Oluwatosin Mary"
    },
    "2024-09-15": {
      "scripture": {
        "reference": " Isaiah 41:10.KJV",
        "text": "“Fear thou not; for I am with thee: be not dismayed; for I am thy God: I will strengthen thee; yea, I will help thee; yea, I will uphold thee with the right hand of my righteousness”"
      },
      "day": "15",
      "image": "day15.jpg",
      "title": "FEAR NOT BUT INSIST",
      "devotionalText1": "Sitting with my thoughts on a certain day and a question pops up in my mind What if you fail? Well, I responded with assurance “then I will pack my bags and go back home but I will try again because nothing fails in my hands”. I remembered a scripture that says and whatsoever he lays his hands upon shall prosper. ",
      "devotionalText2": "The Bible reportedly mentions “fear not” 365 times, suggesting God's desire for believers to live boldly, not timidly. Believers must come to the understanding of God’s love and presences in every situation or challenge. Fear restricts believers, hindering them from taking courageous steps inspired by the Holy Spirit. Fear is destructive and not a fruit of the spirit and we should take conscious steps to fight fear the same way he fights to live a righteous life (it is a good fight). ",
      "devotionalText3": "Don’t let fear hold you down! One particular fear people have is the fear of failure many have been asked the same question “What if you fail”. Or you must have asked yourself, ‘what if I fail?’ But come to think about it, “What if you succeed?” Just go ahead and take that bold step in faith.",
      "devotionalText4": "Counter fear by speaking God's word over situations. “”",
      "devotionalText5": "",
      "reflection": "What bold step are you avoiding due to fear?",
      "prayer": "Father in the name of Jesus let there be a manifestation of the spirit of boldness in my life amen.",
      "affirmation": "Whatever I lay my hands on must flourish. ",
      "author": "Adedokun Olajire"
    },
    "2024-09-16": {
      "scripture": {
        "reference": "Nehemiah 4:20",
        "text": "“In what place therefore ye hear the sound of the trumpet, resort ye thither unto us: our God shall fight for us”"
      },
      "day": "16",
      "image": "day16.jpg",
      "title": "TAKE REFUGE IN GOD’S STRENGTH.",
      "devotionalText1": "In life we often face challenges that can leave us feeling overwhelmed and uncertain. It can be easy to lose hope and doubt our abilities to overcome those obstacles. But as believers we have a powerful source of strength to rely on, our God. ",
      "devotionalText2": "Nehemiah understood the importance of seeking refuge in God’s strength. As he led the people in the rebuilding of the wall of Jerusalem, they faced opposition and threats from their enemies. In the midst of their fear and uncertainty, Nehemiah reminded to gather together whenever they heard the sound of the trumpet. ",
      "devotionalText3": "He assured them that God will fight for them. Just as the people of Jerusalem found comfort and security in gathering together under Nehemiah’s leadership, we too can find solace in coming together as a community of believers. ",
      "devotionalText4": "When we face challenges, it is vital to surround ourselves with fellow Christians, who can provide support, encouragement and prayers. When we gather together in prayers, we invite the presence of God into our midst. We acknowledge that we cannot fight our battles alone, and that we need his guidance and strength. As we unite our voice in prayer, we can trust that God will fight for us, just as he did for the people of Jerusalem. ",
      "devotionalText5": "Let us remember that we are not alone in our struggles, let us remember that we have a loving and powerful God, who is ever ready to fight on our behalf. So whenever we hear the trumpet sound, of uncertainty and fear, let us seek refuge in God’s strength gathering together in prayers, trusting that He will lead us to Victory. ",
      "reflection": "",
      "prayer": "Heavenly Father, thank you for the reminder that we can stand in your strength. In the midst of the storm and challenges, fill us with courage and wisdom and help us to always remember to gather ourselves as believers and seek your face, whole heartedly.",
      "affirmation": "",
      "author": "Adeleke Oluwatodimu."
    },
    "2024-09-17": {
      "scripture": {
        "reference": "Mark 11:24",
        "text": "“Therefore, I tell you, whatever you ask for in prayer, believe that you have received it, and it will be yours.”"
      },
      "day": "17",
      "image": "day17.jpg",
      "title": "THINK IT, FAITH IT & HAVE IT",
      "devotionalText1": "“The story is told of a farmer who found an eagle’s egg and placed it under a hen. The eaglet hatched with the chicks and grew up with them. All his life, the eagle did what the chickens did, thinking he was a chicken. One day, he saw an eagle soaring high above and was filled with awe. 'Who is that?' he asked. 'That's the eagle, the king of the birds,' the hen replied. 'But you belong down here with us, not up there.' The eagle believed the hen and continued living his life as a chicken. He died never knowing he could have soared like the eagle he was created to be.” ",
      "devotionalText2": "Our thoughts shape our reality. Proverbs 23:7 tells us that as a man thinks in his heart, so is he. What we believe about ourselves, and our circumstances can either limit us or propel us to greater heights. This is where faith comes into play. Hebrews 11:1 defines faith as the substance of things hoped for, the evidence of things not seen. It is through faith that we claim the promises of God even before they manifest in our lives. Mark 11:24 further emphasizes this by encouraging us to believe that we have received what we ask for in prayer, and it will be ours. When we align our thoughts with God’s promises and have faith in His Word, we position ourselves to receive His blessings. ",
      "devotionalText3": "It all starts with our thinking. If we think according to God's promises, have faith in His Word, and trust Him wholeheartedly, we will see His blessings manifest in our lives. Don't limit yourself with negative thoughts or doubts. ",
      "devotionalText4": "Remember, you are what you think.",
      "devotionalText5": "",
      "reflection": "What thoughts have been limiting you from experiencing God's best in your life, and how can you replace them with thoughts that align with His promises?",
      "prayer": " Heavenly Father, thank You for your promises that are true and steadfast. Give me the strength to believe and not doubt, and to trust that You have great things in store for me. In Jesus' name, Amen.",
      "affirmation": " I am a child of God, blessed and highly favored. I choose to think according to God's Word, have faith in His promises, and receive His abundant blessings in my life.",
      "author": "Ojegele Boluwaji"
    },
    "2024-09-18": {
      "scripture": {
        "reference": "Proverbs 24:16 (TPT)",
        "text": "“For the lovers of God may suffer adversity and stumble seven times, but they will continue to rise over and over again but the unrighteous are brought down by just one calamity and will never be able to rise again.”"
      },
      "day": "18",
      "image": "day18.jpg",
      "title": "OGA / MADAM,  STAND UP!!!",
      "devotionalText1": "“ I did it again, I fell again, I don’t have the will and ability to stop this sin, it is stronger than me, I have prayed and fasted but then after one or two days I go back to the sin, God cannot use me any longer, I have sinned too much, I am too dirty, how will I stand and talk to people.” ",
      "devotionalText2": "These were the words that came out of my mouth to a sister of mine and then she asked me a question- “What is the purpose of detergent? You really love this shirt, after wearing it today it’ll be dirty so is it logical to run away from detergent or to run towards detergent?” Upon hearing this, I felt a surge of joy and hope in my heart. ",
      "devotionalText3": "You are battling with a particular sin, the solution is never to run away from God, don’t allow the devil to use the convenient but harmful drink of condemnation to deceive you, it is very easy to rest in condemnation and feel powerless, so the burden of responsibility looks like its no longer on you, to rest in helplessness. ",
      "devotionalText4": "Oga and Madam, STAND UP!!, you are not helpless, pick yourself up and run back to God. If truly you desire to be free, battle condemnation, you are in Christ Jesus there’s no condemnation for you. ",
      "devotionalText5": "You already have victory over sin, the devil uses condemnation as the trick of deceit but you have seen the light now, the devil has lost it’s grip of condemnation over you.",
      "reflection": "How long will you allow yourself to be bound in  the chains of condemnation?",
      "prayer": "Father, let the consciousness of your love and power in me overwhelm me to overcome sin and condemnation. ",
      "affirmation": "The Love of God manifest in me is greater than the power of any sin. ",
      "author": "-Ayodeji Oluwatobi"
    },
    "2024-09-19": {
      "scripture": {
        "reference": "Jude 1:20-21 NKJV",
        "text": "“But you, beloved, building yourselves up on your most holy faith, praying in the Holy Spirit, keep yourselves in the love of God, looking for the mercy of our Lord Jesus Christ unto eternal life.” "
      },
      "day": "19",
      "image": "day19.jpg",
      "title": "BUILDING YOUR CONVICTION ",
      "devotionalText1": "Did this ever happen to you growing up? You used to diligently read your Bible and listen to only Christian songs, feeling guilty when indulging in certain habits. But over time, after being influenced by popular culture or peer pressure, you began to think it wasn’t that serious. ",
      "devotionalText2": "You started reading your Bible less, even started listening to songs with vulgar lyrics, or you started feeling less guilty about those habits. Maybe someone asked you a question that made you start doubting your beliefs. One could argue that a significant issue you faced was a lack of conviction. Why should you consistently study your Bible? Why should you see the world differently from non-believers? Why abstain from certain secular practices? Why do you believe in Jesus? Is it fear, church teachings, or parental approval? Are you truly convicted by the Holy Spirit, or just playing church? ",
      "devotionalText3": "Do you really know what the Bible says about certain beliefs, or do you follow them just because someone you respect says so? It is crucial to ask these questions because we are in times like those of Noah, where you may have to stand by your convictions alone, even if the rest of the world disagrees. If you compromise, there may be no one to hold you accountable. ",
      "devotionalText4": "Without accountability, how will you grow in your faith, discern false doctrines, or defend your faith and effectively witness for Christ? To build solid, biblical convictions, you should intentionally study your Bible (2Timothy 2:15), pray consistently, surround yourself with like-minded believers (1 Corinthians 15:33-34), and walk in the consciousness of Christ. When you know what you carry, it won't be easy to stray (Ephesians 1:13, 1 Peter 2:9, 1 Corinthians 6:19, John 1:12, Mark 16:17-18). ",
      "devotionalText5": "Finally, be mindful of what you listen to and the places you go; consider changing your playlist. Guard your heart with all diligence (Proverbs 4:23), set clear goals for your spiritual growth, and maintain an atmosphere of worship. Perhaps you've been in the church for donkey's years and still don't understand why certain Christian beliefs are so; let that change starting today. What are your convictions about money, dressing, sex, tithing, and generosity, among other topics?",
      "reflection": "",
      "prayer": " Lord as I begin to put conscious effort to know more about you and your word, let my convictions be grounded in your word and let false doctrines that I have been given into be broken, speak to me so that I may be properly grounded in your word, so that I can effectively defend the faith in Jesus name. Amen",
      "affirmation": "",
      "author": "Elijah Soladoye."
    },
    "2024-09-20": {
      "scripture": {
        "reference": "Hebrews 11:1.",
        "text": "“Faith shows the reality of what we hope for; it is the evidence of things we cannot see”"
      },
      "day": "20",
      "image": "day20.jpg",
      "title": "THE UNSEEN TREASURE",
      "devotionalText1": "What does faith mean to you? For Abraham and other great men of faith in the Bible, faith meant believing in something greater than their present circumstances. They foresaw God’s possibilities and trusted His promises, even when their situations seemed contrary. ",
      "devotionalText2": "Abraham, for instance, was willing to sacrifice his son Isaac, believing that the God who had given him a son in old age could also raise him from the dead. His ultimate desire was to please God. “And it is impossible to please God without faith. Anyone who wants to come to him must believe that God exists and that he rewards those who sincerely seek him” - Hebrews 11:6. ",
      "devotionalText3": "Consider the Israelites marching around Jericho’s walls, or the many who died still believing in God’s promises without receiving them. Their faith was steadfast despite not seeing immediate results. Hebrews 11:13 states, “All these people died still believing what God had promised them. They did not receive what was promised, but they saw it all from a distance and welcomed it.” ",
      "devotionalText4": "Moreover, Hebrews 11:35-38 describes the extreme trials others endured for their faith—torture, imprisonment, and death—holding on to the hope of a better life after the resurrection. These acts of faith are mind-blowing. Think of Noah, who built an ark for years despite no sign of rain, enduring mockery but holding on to God’s word. ",
      "devotionalText5": "What does faith mean to me? Faith is having supernatural foresight, seeing beyond the natural eye, and holding on to something you value, something worth dying for, even if you don’t see it happen.",
      "reflection": "What does faith mean to you? In what area of your life do you need to show more faith in God?",
      "prayer": "Heavenly Father, thank you for your child reading this. Thank you because we know that their life is in your hands. I ask that you give them the grace to trust you completely and to have faith in your work in their life. In Jesus' name, Amen.",
      "affirmation": "I am unwavering in my faith in Jesus Christ, trusting His love and guidance in every step of my journey.",
      "author": "Onyekachi Eseagwu"
    },
    "2024-09-21": {
      "scripture": {
        "reference": "1 Peter 2:9 KJV",
        "text": "“But ye are a chosen generation, a royal priesthood, an holy nation, a peculiar people; that ye should shew forth the praises of him who hath called you out of darkness into his marvelous light”"
      },
      "day": "21",
      "image": "day21.jpg",
      "title": "EMBRACING YOUR TRUE IDENTITY: A BIBLICAL PERSPECTIVE EMBRACING YOUR TRUE IDENTITY: A BIBLICAL PERSPECTIVE ",
      "devotionalText1": "In a world filled with noise, distractions, and conflicting doctrines, it’s easy to lose sight of who we are and our true identity. However, as believers, we have been called to a life that transcends the world’s expectations and opinions. ",
      "devotionalText2": "According to the scripture above, we are a chosen generation, a royal priesthood, a  holy nation, a peculiar people. We have been called out of darkness into His marvelous light to show forth His praises. Our identity is not defined by the world, friends, family, peer pressure, circumstances, economy, hurts, or pains. Christ Jesus is the only One who has the authority to define our identity. ",
      "devotionalText3": "As stated in Matthew 5:14, “Ye are the light of the world. A city that is set on an hill cannot be hid.” We are meant to shine, not succumb to the darkness. We are also the salt of the earth, called to make a difference and add flavor to the world (Matthew 5:13). Finding your identity and becoming conscious of who you are is crucial. ",
      "devotionalText4": "Your identity is rooted in Christ Jesus. Embrace your true self, and let His light shine through you. This is a reminder that you should carry yourself like the King and priest that you are, wherever you find yourself. I encourage you to practice words of affirmation, reminding yourself of who you are in Christ.",
      "devotionalText5": "Dear Omoba (King’s child), shut yourself out from the noise of the world. Instead, tune in to the affirming voice of God, daily stay with the Word, reminding you of your true identity. You are a King’s child, and you are meant to reign in life.",
      "reflection": "Write out everything Christ has said about you,  who He has called you to be as seen in the following scriptures, and daily affirm the truths in Galatians 2:20, 1 John 4:17, Matthew 5:14, Ephesians 2:10, 1 Corinthians 1:30, Colossians 2:10.",
      "prayer": "",
      "affirmation": "",
      "author": "Jesutomisin Alonge"
    },
    "2024-09-22": {
      "scripture": {
        "reference": "Psalm 105:4-5 ",
        "text": "“Seek the Lord and His strength; seek His face continually. Remember His wonderful deeds, His wonders, and the judgments He has uttered.” "
      },
      "day": "22",
      "image": "day22.jpg",
      "title": "ENCOUNTERING THE DIVINE (THE GOD EXPERIENCE)",
      "devotionalText1": "Have you ever felt God's presence in a profound way? Have you had a moment that left you in awe, wonder, and gratitude at the same time? We call this “The God Experience”. Exodus 33:14-15. It is a continuous journey of encountering God’s presence in our lives. It’s not just about feeling God’s presence, but also about trusting in His continuous guidance and provision. The God Experience is a personal encounter with God, a moment of connection that transcends words and rational understanding. ",
      "devotionalText2": "It touches your heart, mind and soul. I want you to begin to value your God Experiences, start documenting them in a journal if you haven't been doing so, share some of them with a friend or family member to strengthen your faith and theirs, also ask God to deepen your relationship with Him so that your God Experience will be an outflow of your devotion to him everyday.””",
      "devotionalText3": "",
      "devotionalText4": "",
      "devotionalText5": "",
      "reflection": "Take a moment to reflect on your own God Experiences. How did they shape you? How did they change your perspective? How did they draw you closer to God?",
      "prayer": "Dear God, we seek Your face, Your strength, and Your presence, may we daily encounter You in ways that transform us. May our lives be a testament to Your love and grace in Jesus' name Amen.",
      "affirmation": "God's presence is my guiding light, and I surrender to its transformative power in my life.",
      "author": "Oni Prisca"
    },
    "2024-09-23": {
      "scripture": {
        "reference": "Proverbs 8:14 (TPT)",
        "text": "“You will find true success when you find me, for I have insight into wise plans that are designed just for you. I hold in my hands living-understanding, courage, and strength.”"
      },
      "day": "23",
      "image": "day23.jpg",
      "title": "HE STANDS IN THE GREY AREAS OF YOUR LIFE",
      "devotionalText1": "A few years back, I had a dream and heard “He stands in the grey areas of your life”. While my life laid confusing as a teenager and Abba said He had everything in control, it did not seem so. I was panicking inside out till we got to the end of that tunnel. The Lord does not want to give you a regular life, He wants to fill you as you age with stories of His faithfulness which only you and Him knows. He will lead you to places you never thought and You will probably find yourself saying “this was not the plan” or “time is going”.",
      "devotionalText2": "Even now I have questions about this adventure of life but I leave you with these words from my Lord: “Come into the secret place and find encouragement that waters your thirsty soul. I have words of life to share with you today and living-understanding to strengthen you. Run into the shelter of my presence and let my love wash over you in a fresh way. I don’t offer stale bread to my hungry lovers. Eat of my now word. Tune your ear to my voice. Give me the heavy weight of the burden of fear you are carrying. ",
      "devotionalText3": "There may be uncertainties in your life, but I see everything clearly. There are no mysteries to me, and I won’t let the tides of confusion sweep you away. See how my hand holds you steady. You cannot escape the grip of my glorious grace, child. What wondrous plans I have for you. What a future you have in me. Let me guide you further into my goodness as you follow my leading. I promise never to let you go or get too far ahead. I give you eyes to see from my perspective. Look to me, and nothing will ever shatter your hope.”",
      "devotionalText4": "",
      "devotionalText5": "",
      "reflection": "Do you trust God even in the grey areas of your life?",
      "prayer": "Dear Lord, please strengthen me to trust you more and more.",
      "affirmation": "",
      "author": "Ademehin Jesuloluwa "
    },
    "2024-09-24": {
      "scripture": {
        "reference": "Eph 4:31-32 NLT",
        "text": "“Get rid of all bitterness, rage, anger, harsh words and slander as well as all types of all evil behavior. Instead, be kind to each other, tenderhearted, forgiving one another, just as God through Christ has forgiven you. “ "
      },
      "day": "24",
      "image": "day24.jpg",
      "title": "FORGIVENESS",
      "devotionalText1": "Forgiveness is releasing every anger, bitterness and rage to God and trusting him to deal with it in his justice and love. Forgiveness is opening your fisted hands to receive. It is impossible to receive anything with your hands being fisted, it has to be opened. ",
      "devotionalText2": "This means when the spirit of forgiveness is not in you, you struggle to get some certain things in your life. You need to offload the heavy burden in your heart to be able to access heavenly blessings. Remember, according to  Matthew 18:22 you have to forgive 70*7 times in a day. ",
      "devotionalText3": "There was a story of a young lady who was bitter with her father, this lady insisted there was no way her father will receive forgiveness from her because he abandoned her when she needed a father’s love as a child, she struggled through life until the holy spirit ministered to her to let go and open her fisted hands. She forgave him and her journey through life took a turn. She began enjoying genuine happiness and peace.",
      "devotionalText4": "For as many of you reading this devotional today, I pray that the grace to forgive that person who has wronged you in one way or the other be given to you in the mighty name of Jesus. (Amen)",
      "devotionalText5": "",
      "reflection": "Is there heaviness, grudge and pain in your heart right now, which is hard for you to let go. ",
      "prayer": "Lord Jesus, I come to you with this heaviness of heart due to my inability to forgive,  I ask that you bestow on me the spirit of Forgiveness. Help me to release and let go every grudge, hatred and pain I have towards anyone this minute. In Jesus mighty name. Amen",
      "affirmation": "",
      "author": "Foregan Joan"
    },
    "2024-09-25": {
      "scripture": {
        "reference": "Proverbs 4:7 KJV",
        "text": "Wisdom is the principal thing; therefore get wisdom: And with all thy getting get understanding."
      },
      "day": "25",
      "image": "day25.jpg",
      "title": "THE EXCELLENCE OF WISDOM ",
      "devotionalText1": "The complexity of this world’s affair is enough reason for us to know that there has to be an exceptional virtue in which any man who aims to navigate life successfully must possess. Just imagine God giving King Solomon a blank cheque and all he requested was WISDOM. Solomon operated in an unusual capacity to the point that he gained global and transgenerational relevance. ",
      "devotionalText2": "I understand that God intends for us to accomplish a lot on earth and it is even possible that we already have a glimpse, but until we subscribe to this great and powerful secret, life will be full of frustration. Wisdom is knowing what to do at EVERY GIVEN TIME and doing it. God’s intention for his children is that they keep winning. Contrary to the popular saying that life is full of ups and down, we are ordained for ups and ups, Proverbs 4:18.",
      "devotionalText3": " The reason the former has become the norm is because we often do things with only earthly wisdom whereas, the wisdom from above never fails. Take a minute to imagine how your life will be if you always know what to do and you always get it done. The pains, disappointment and frustration we often experience may be a clear indication that wisdom is lacking. The good news is, God has promised us that any point we need wisdom we should ask and he will freely give to us [James1:5 NLT) ‘If you need wisdom, ask our generous God, and he will give it to you. He will not rebuke you for asking. God’s resources are unlimited. Regardless of the number of times we ask, His wisdom can never be exhausted. ",
      "devotionalText4": "Never feel like you are asking for too much or disturbing God. As a matter of fact He wants us to totally depend on him at all time. It is foolishness to think that you can do this life just by common sense, the best you will get from that is common result. As God’s own you are meant to totally depend on God for direction and empowerment to carry out every task. You can do a whole lot if you will subscribe to always seek God’s wisdom before making any decision even when the end seem predictable.",
      "devotionalText5": "",
      "reflection": "Do you agree that you can not succeed in life without the wisdom of God?",
      "prayer": "Dear Jesus, you are the Only Wise God, please help me know what to do per time and give me sufficient grace to execute it.",
      "affirmation": "I am loved by God.",
      "author": " Olakanmi Boluwatife."
    },
    "2024-09-26": {
      "scripture": {
        "reference": "Philippians 3:14 KJV",
        "text": "“I press toward the mark for the prize of the high calling of God in Christ Jesus”"
      },
      "day": "26",
      "image": "day26.jpg",
      "title": "THE POWER OF GROWING GRADUALLY: HOW SMALL STEPS LEAD TO GREATNESS ",
      "devotionalText1": "In the pursuit of our dreams, it’s easy to be daunted by the magnitude of our ambitions. We often envision success as a sudden, sweeping triumph, a grand achievement that happens all at once. However, real success is rarely a product of overnight miracles. Instead, it is the cumulative result of many small, consistent efforts, just as a vast ocean is formed by countless tiny drops of water.",
      "devotionalText2": "Individually, each drop may seem insignificant, but together, they create something immense and powerful. This metaphor serves as a powerful reminder that the journey to great accomplishments is built upon the foundation of small, deliberate actions. Every little effort, every minor step forward, contributes to the creation of something much larger than itself.  The importance of gradual growth cannot be overstated. Success that is built slowly and steadily is often the most enduring.",
      "devotionalText3": "When we allow ourselves to grow incrementally, we develop the resilience, skills, and wisdom needed to sustain our success over the long term. Much like how a tree strengthens its roots and grows taller over time, our abilities and understanding deepen as we move forward one step at a time. This gradual growth also offers us the invaluable opportunity to learn and adapt as we progress. It teaches us patience and perseverance, helping us to overcome challenges and refine our approach. Each small step forward does not only brings us closer to our goals but also prepares us for the greater challenges that lie ahead. ",
      "devotionalText4": "Additionally, the process of growing gradually instills a sense of appreciation for the journey. By acknowledging and celebrating each small achievement, we remain motivated and engaged, understanding that these seemingly minor victories are the building blocks of our ultimate success. This shift in perspective allows us to focus on the present, finding joy in the progress we make each day. In essence, the phrase “tiny drops lead to vast oceans” illustrates the profound impact of small, consistent efforts. By embracing the power of gradual growth, we build the patience, persistence, and appreciation necessary to achieve our dreams. It reminds us that every small action contributes to a greater whole and that each step forward, no matter how small, brings us closer to creating our own vast ocean of success.",
      "devotionalText5": "",
      "reflection": "Will you begin to see every little step in your journey as a significant progress?",
      "prayer": "Dear Lord, help me remain committed to every small step that leads to my greatness ",
      "affirmation": "",
      "author": "Popoola Glory"
    },
    "2024-09-27": {
      "scripture": {
        "reference": "Romans 12:11",
        "text": "“ Not Slothful in business , fervent in Spirit, serving the Lord”"
      },
      "day": "27",
      "image": "day27.jpg",
      "title": "NOT SLOTHFUL/LAZY IN BUSINESS",
      "devotionalText1": "In our fast-paced world, the importance of not being slothful or lazy in business cannot be overstated. Diligence is the cornerstone of success, as it requires consistent effort, perseverance, and a relentless pursuit of excellence. ",
      "devotionalText2": "When we approach our work with diligence, we set ourselves apart from the competition, demonstrating our commitment to achieving our goals and delivering exceptional results. Moreover, being fervent in Spirit goes hand in hand with diligence. It's about cultivating a passionate and enthusiastic attitude towards our work, infusing everything we do with energy and purpose. ",
      "devotionalText3": "Fervency in Spirit propels us forward, driving us to push the boundaries of what's possible and to constantly seek out new opportunities for growth and innovation. But beyond the realm of business, serving God adds a profound dimension to our lives. It's about aligning our actions with God’s values, living with integrity, and making a positive impact on the world around us. By serving others, whether through acts of kindness or mentorship, we not only enrich the lives of those we touch but also find fulfilment and meaning in our own lives. ",
      "devotionalText4": "In essence, the principles of not being slothful in business, being fervent in Spirit, and serving God are not just ideals to aspire to, they are the keys to unlocking our full potential and leading a life of purpose and significance. So let's embrace these principles wholeheartedly, both in our professional endeavours and in our personal lives, as we strive to make a meaningful difference in the world.",
      "devotionalText5": "",
      "reflection": "How can I infuse more diligence and fervency into my daily work to better serve God and others?",
      "prayer": "Lord, help me to be diligent in all my endeavours. Fill my spirit with passion and purpose, and guide me to serve You faithfully in all that I do. May my actions reflect Your love and bring glory to Your name. Amen.",
      "affirmation": " I am industrious , enthusiastic, and faithful in my service to God.",
      "author": "Grace Obatode"
    },
    "2024-09-28": {
      "scripture": {
        "reference": "1 Corinthians 4:2",
        "text": "Moreover, it is required in stewards that a man be found faithful."
      },
      "day": "28",
      "image": "day28.jpg",
      "title": "FINANCIAL STEWARDSHIP",
      "devotionalText1": "“The ability to manage small to becoming big is a major factor for the entrustment of Kingdom resources” Bishop David Abioye. The parable of the talents in Matthew 25:14–30 illustrates the importance of managing resources wisely. A master entrusts his servants with talents, expecting them to invest and multiply them. Similarly, God has given us resources, talents, and abilities to manage for His kingdom's advancement. ",
      "devotionalText2": "As stewards, we must recognize that God is the giver of all things (James 1:17) and that we will give an account of our management (Romans 14:12) As faithful stewards, we must acknowledge God as the giver of our resources and use them to further His kingdom's purposes. We should give freely, sacrifice willingly, and avoid wasting God's resources or using them for personal gain only. ",
      "devotionalText3": "Instead, we should strive to multiply our talents and resources, just like the servants in the parable who returned their master's investment with interest. We must also remember that our resources are not our own, but God's. We are merely managers of what He has entrusted to us. Our goal should be to hear our Master say,“Well done, good and faithful servant!” (Matthew 25:21). We must be mindful of our responsibility to manage God's resources effectively, knowing that we will give an account of our stewardship.",
      "devotionalText4": "May we seek to honor God with our resources, trusting that He will bless our efforts and multiply our resources. As we reflect on our financial stewardship, let us ask ourselves: Have I been a good steward of what God has given me? Have I used my resources to advance God's kingdom?",
      "devotionalText5": "",
      "reflection": "",
      "prayer": " Lord, help me to be a good steward of all you have given me.",
      "affirmation": "I am blessed by God to be a blessing. I am a good steward of all God has given me, and I use these resources to bring profit to the Kingdom.",
      "author": "-Ayandipe Deborah "
    },
    "2024-09-29": {
      "scripture": {
        "reference": "Ephesians 2:10 AMP",
        "text": "“For we are His workmanship [His own master work, a work of art], created in Christ Jesus [reborn from above—spiritually transformed, renewed, ready to be used] for good works, which God prepared [for us] beforehand [taking paths which He set], so that we would walk in them [living the good life which He prearranged and made ready for us].”"
      },
      "day": "29",
      "image": "day29.jpg",
      "title": "MADE FOR MORE",
      "devotionalText1": "Birthdays are always a big deal for me. Each year presents itself differently in relation to how I feel about the new year. Most times, I feel pure joy and excitement for the day. Other times, I dread the thought of growing older and having more responsibility. This year, however, was very different. Seven days before my birthday, I stumbled upon a documentary about the life of a great woman. As I watched that documentary, I had a striking epiphany. I’m made for more.",
      "devotionalText2": "That moment significantly shifted my perspective, tone, and approach toward my birthday and the rest of my life. That singular moment gave me such a strong sense of purpose and responsibility stepping into the new year. Today may not be your birthday, but there’s no better day to jack your spirit with the realization that You Are Made For More! More than what you see when you look in the mirror. ",
      "devotionalText3": "More than the plans, goals, or dreams you have set for yourself. More than what you’ve accomplished or lost over the years. More than what people say of you and to you. Why am I so sure? Scripture says in Ephesians 2:10 (TPT version) that God planned in advance the destiny you would fulfill and the good works you would do to achieve it. Whatever you see now is not up to a fragment of who God has destined you to be! My dear friend, You are a work of art! Let your eyes be open now. ",
      "devotionalText4": "There is more! Let your hunger arise. There is more! Reach deep into God to see what He planned for your life and destiny. And begin to live in more. God bless you.      ",
      "devotionalText5": "",
      "reflection": "Who’s lens have you used to view yourself up until now? How will you intentionally begin to see you through heaven’s perspective?",
      "prayer": " Lord, open my eyes to see the real me and grant me the grace and strength to walk in the fullness of the life you have destined me to live.",
      "affirmation": " I am God’s workmanship. His masterwork. A work of art! I am transformed, renewed, and ready for good works by the Spirit of God. I walk confidently in the fullness of life God has prepared for me. I am made for more!",
      "author": "Olori Oghenemaero."
    },
    "2024-09-30": {
      "scripture": {
        "reference": "",
        "text": ""
      },
      "day": "30",
      "image": "day6.jpg",
      "title": "THANK YOU",
      "devotionalText1": "",
      "devotionalText2": "",
      "devotionalText3": "",
      "devotionalText4": "",
      "devotionalText5": "",
      "reflection": "",
      "prayer": "",
      "affirmation": "",
      "author": "Aresiola Elizabeth."
    }
  }
}
